#!/bin/bash
cd ../lagou/
echo "================================================"
echo "==                                            =="
echo "==        IT职业分析系统(数据库更新)          =="
echo "==                                            =="
echo "================================================"
echo "\n"
sleep 2s
echo "-----------------请保证网络畅通-------------------"
echo "---------------该过程将持续200min-----------------"
echo "\n"
sleep 3s
echo "------------------正在启动爬虫--------------------"
echo "\n"
echo "3"
sleep 1s
echo "2"
sleep 1s
echo "1"
sleep 1s
scrapy crawl position
